docs/posts/2018-10-06-my-oklahoma-home.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Oklahoma Home</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">My Oklahoma Home</h1>
<p class="subtitle" role="doc-subtitle">Oct 06, 2018</p>
</header><p>
My latest song:<br>
</p>

<p>
VERSE 1: I-40 East, on a cloudy day, Memphis up ahead, had to get away; Had nothing in mind Just looking for a place to roam. Thought I could see, but I was dumb and blind; Gave no thought to what I left behind, The people that I love, and my Oklahoma home.<br>
</p>

<p>
CHORUS: They say that heaven&rsquo;s paved With streets of gold, There’s no more tears Or so I’ve been told No more pain, And no one feels alone. But by those streets Where the children play, I hope to find just a little red clay To remind me Of my Oklahoma home.<br>
</p>

<p>
VERSE 2: Mind starts to wander when you drive for miles, You think about faces, remember the smiles, And you realize you&rsquo;re old, But you&rsquo;ve never ever really grown. So you turn the car into the setting sun, The journey goes on, but the running is done. God help me back To my Oklahoma home.<br>
</p>

<p>
VERSE 3: You can’t leave, even if you tried, When you’ve got red dirt deep down inside, No matter how much you wanted To leave it alone. When you’re running away to another town, No road is straight, they all circle around, Bringing you back To your Oklahoma home.<br>
</p>

<p>
BRIDGE: Okemah up ahead, the tears are making me blind, And I hear the voice of Woody deep inside my mind, And It&rsquo;s taken thirty years, but now I understand, That these are my people, and this is my land, And these Oklahoma hills will always be home.
</p>


<div class="tagline" id="orge97d58d">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
